app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "email@email.com"], ["first_name", "First"], ["last_name", "Last"], ["password_digest", "$2a$04$0IxKRC4t1T.dzrTAoUXrUu5yWgMxeLOsQTXpklwTb/RatuTujYOfq"]]
INSERT INTO "user_roles" ("user_id", "role_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 229], ["role_id", 1]]
---
  def create
    @user = User.create(user_params)
    @user.roles.create(title: "traveler")